rtborg/STM32F303K8_PFMB_PCBoard/PFMB_Project_Software/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RS485_ADDR_7_Pin GPIO_PIN_0
#define RS485_ADDR_7_GPIO_Port GPIOA
#define RS485_ADDR_6_Pin GPIO_PIN_1
#define RS485_ADDR_6_GPIO_Port GPIOA
#define RS485_ADDR_5_Pin GPIO_PIN_2
#define RS485_ADDR_5_GPIO_Port GPIOA
#define RS485_ADDR_4_Pin GPIO_PIN_3
#define RS485_ADDR_4_GPIO_Port GPIOA
#define RS485_ADDR_3_Pin GPIO_PIN_4
#define RS485_ADDR_3_GPIO_Port GPIOA
#define RS485_ADDR_2_Pin GPIO_PIN_5
#define RS485_ADDR_2_GPIO_Port GPIOA
#define RS485_ADDR_1_Pin GPIO_PIN_1
#define RS485_ADDR_1_GPIO_Port GPIOB
#define RS485_ADDR_0_Pin GPIO_PIN_8
#define RS485_ADDR_0_GPIO_Port GPIOA
#define Keepalive_LED_Pin GPIO_PIN_7
#define Keepalive_LED_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
